### Plan for production
Plan: 3 to add, 3 to change, 3 to destroy.

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_policy.ab_testing_task_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "ab_testing_task_role_policy" {
        id          = "arn:aws:iam::090999133015:policy/ab-testing-task-role-policy"
        name        = "ab-testing-task-role-policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = [
                            "dynamodb:Scan",
                            "dynamodb:Query",
                            "dynamodb:PutItem",
                            "dynamodb:GetItem",
                            "dynamodb:BatchWriteItem",
                            "dynamodb:BatchGetItem",
                        ]
                        Condition = {
                            StringEquals = {
                                "aws:sourceVpc" = "vpc-08c2ab7b7b894be17"
                            }
                        }
                        Effect    = "Allow"
                        Resource  = [
                            "arn:aws:dynamodb:eu-west-1:090999133015:table/ab_tests",
                            "arn:aws:dynamodb:eu-west-1:090999133015:table/ab_test_participants",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:eu-west-1:090999133015:key/a4b78f77-eade-43ce-9b21-6070fa66179d"
                    },
                    {
                        Action   = [
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueUrl",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:eu-west-1:090999133015:edited_feature_flag"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "3807992842851518138" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-09T10:30:42Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "5382498471716169480" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-09T10:30:42Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing:24" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.31-145" -> "0.0.29-6"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (6 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.31-145" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.29-6"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 24 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.31-145" -> "0.0.29-6"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.31-145" -> "0.0.29-6"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.event_sourcing.module.table["AbTestChangeEvent"].snowflake_table.this will be updated in-place
  ~ resource "snowflake_table" "this" {
        id                  = "RAW|AUTOMOTIVE|UK_MULTI_AB_TESTING_ABTESTCHANGEEVENT"
        name                = "UK_MULTI_AB_TESTING_ABTESTCHANGEEVENT"
        # (7 unchanged attributes hidden)

      ~ column {
          ~ name     = "EVENT_TIME" -> "PARTICIPANT_ID"
            # (2 unchanged attributes hidden)
        }
      ~ column {
          ~ name     = "EVENT_DATA" -> "RESOURCE_VERSION"
          ~ type     = "VARIANT" -> "NUMBER(38,0)"
            # (1 unchanged attribute hidden)
        }
      ~ column {
          ~ name     = "PARTICIPANT_ID" -> "EVENT_TIME"
            # (2 unchanged attributes hidden)
        }
      ~ column {
          ~ name     = "RESOURCE_VERSION" -> "EVENT_DATA"
          ~ type     = "NUMBER(38,0)" -> "VARIANT"
            # (1 unchanged attribute hidden)
        }
    }

  # module.event_sourcing.module.table["AbTestParticipantAllocationEvent"].snowflake_table.this will be updated in-place
  ~ resource "snowflake_table" "this" {
        id                  = "RAW|AUTOMOTIVE|UK_MULTI_AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT"
        name                = "UK_MULTI_AB_TESTING_ABTESTPARTICIPANTALLOCATIONEVENT"
        # (7 unchanged attributes hidden)

      ~ column {
          ~ name     = "EVENT_TIME" -> "RESOURCE_VERSION"
          ~ type     = "VARCHAR(16777216)" -> "NUMBER(38,0)"
            # (1 unchanged attribute hidden)
        }
      ~ column {
          ~ name     = "EVENT_DATA" -> "EVENT_TIME"
          ~ type     = "VARIANT" -> "VARCHAR(16777216)"
            # (1 unchanged attribute hidden)
        }
      ~ column {
          ~ name     = "RESOURCE_VERSION" -> "EVENT_DATA"
          ~ type     = "NUMBER(38,0)" -> "VARIANT"
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.
```
</details>
